#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mgoogle_dns_managed_zone.portfolio: Refreshing state... [id=projects/data-visitor-334805/managedZones/piper-codes][0m
[0m[1mgoogle_compute_global_address.portfolio: Refreshing state... [id=projects/data-visitor-334805/global/addresses/portfolio][0m
[0m[1mgoogle_cloud_run_service.portfolio: Refreshing state... [id=locations/us-central1/namespaces/data-visitor-334805/services/portfolio][0m
[0m[1mgoogle_dns_record_set.portfolio: Refreshing state... [id=projects/data-visitor-334805/managedZones/piper-codes/rrsets/piper.codes./A][0m
[0m[1mgoogle_compute_managed_ssl_certificate.portfolio: Refreshing state... [id=projects/data-visitor-334805/global/sslCertificates/portfolio][0m
[0m
[1m[36mNote:[0m[1m Objects have changed outside of Terraform[0m

[0mTerraform detected the following changes made outside of Terraform since the
last "terraform apply":

[1m  # google_cloud_run_service.portfolio[0m has changed[0m[0m
[0m  [33m~[0m[0m resource "google_cloud_run_service" "portfolio" {
        [1m[0mid[0m[0m                         = "locations/us-central1/namespaces/data-visitor-334805/services/portfolio"
        [1m[0mname[0m[0m                       = "portfolio"
      [32m+[0m [0m[1m[0mstatus[0m[0m                     = [
          [32m+[0m [0m{
              [32m+[0m [0mconditions                   = [
                  [32m+[0m [0m{
                      [32m+[0m [0mmessage = "Image 'us-central1-docker.pkg.dev/data-visitor-334805/general/portfolio:0422346' not found."
                      [32m+[0m [0mreason  = "ContainerMissing"
                      [32m+[0m [0mstatus  = "False"
                      [32m+[0m [0mtype    = "Ready"
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mmessage = "Image 'us-central1-docker.pkg.dev/data-visitor-334805/general/portfolio:0422346' not found."
                      [32m+[0m [0mreason  = "ContainerMissing"
                      [32m+[0m [0mstatus  = "False"
                      [32m+[0m [0mtype    = "ConfigurationsReady"
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mmessage = "Image 'us-central1-docker.pkg.dev/data-visitor-334805/general/portfolio:0422346' not found."
                      [32m+[0m [0mreason  = "ContainerMissing"
                      [32m+[0m [0mstatus  = "False"
                      [32m+[0m [0mtype    = "RoutesReady"
                    },
                ]
              [32m+[0m [0mlatest_created_revision_name = "portfolio-xnkxs"
              [32m+[0m [0mlatest_ready_revision_name   = ""
              [32m+[0m [0mobserved_generation          = 1
              [32m+[0m [0murl                          = ""
            },
        ]
        [90m# (3 unchanged attributes hidden)[0m[0m

      [32m+[0m [0mmetadata {
          [32m+[0m [0m[1m[0mannotations[0m[0m      = {
              [32m+[0m [0m"run.googleapis.com/ingress"        = "all"
              [32m+[0m [0m"run.googleapis.com/ingress-status" = "all"
              [32m+[0m [0m"serving.knative.dev/creator"       = "github-workflow@data-visitor-334805.iam.gserviceaccount.com"
              [32m+[0m [0m"serving.knative.dev/lastModifier"  = "github-workflow@data-visitor-334805.iam.gserviceaccount.com"
            }
          [32m+[0m [0m[1m[0mgeneration[0m[0m       = 1
          [32m+[0m [0m[1m[0mlabels[0m[0m           = {
              [32m+[0m [0m"cloud.googleapis.com/location" = "us-central1"
            }
          [32m+[0m [0m[1m[0mnamespace[0m[0m        = "data-visitor-334805"
          [32m+[0m [0m[1m[0mresource_version[0m[0m = "AAXS2S6iPYU"
          [32m+[0m [0m[1m[0mself_link[0m[0m        = "/apis/serving.knative.dev/v1/namespaces/383867973730/services/portfolio"
          [32m+[0m [0m[1m[0muid[0m[0m              = "6eefedb6-7c3c-49f7-8b53-6b67b0e63de0"
        }

      [33m~[0m [0mtemplate {
          [32m+[0m [0mmetadata {
              [32m+[0m [0m[1m[0mannotations[0m[0m = {
                  [32m+[0m [0m"autoscaling.knative.dev/maxScale" = "100"
                }
              [32m+[0m [0m[1m[0mgeneration[0m[0m  = 0
              [32m+[0m [0m[1m[0mlabels[0m[0m      = {}
            }

          [33m~[0m [0mspec {
              [33m~[0m [0m[1m[0mcontainer_concurrency[0m[0m = 0 [33m->[0m [0m80
              [33m~[0m [0m[1m[0mtimeout_seconds[0m[0m       = 0 [33m->[0m [0m300

              [33m~[0m [0mcontainers {
                  [32m+[0m [0m[1m[0margs[0m[0m    = []
                  [32m+[0m [0m[1m[0mcommand[0m[0m = []
                    [90m# (1 unchanged attribute hidden)[0m[0m

                  [32m+[0m [0mports {
                      [32m+[0m [0m[1m[0mcontainer_port[0m[0m = 8080
                      [32m+[0m [0m[1m[0mname[0m[0m           = "http1"
                    }

                  [32m+[0m [0mresources {
                      [32m+[0m [0m[1m[0mlimits[0m[0m   = {
                          [32m+[0m [0m"cpu"    = "1000m"
                          [32m+[0m [0m"memory" = "512Mi"
                        }
                      [32m+[0m [0m[1m[0mrequests[0m[0m = {}
                    }
                }
            }
        }

      [32m+[0m [0mtraffic {
          [32m+[0m [0m[1m[0mlatest_revision[0m[0m = true
          [32m+[0m [0m[1m[0mpercent[0m[0m         = 100
        }
    }

[1m  # google_dns_managed_zone.portfolio[0m has changed[0m[0m
[0m  [33m~[0m[0m resource "google_dns_managed_zone" "portfolio" {
        [1m[0mid[0m[0m            = "projects/data-visitor-334805/managedZones/piper-codes"
      [32m+[0m [0m[1m[0mlabels[0m[0m        = {}
        [1m[0mname[0m[0m          = "piper-codes"
        [90m# (6 unchanged attributes hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # google_cloud_run_service.portfolio[0m is tainted, so must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "google_cloud_run_service" "portfolio" {
      [33m~[0m [0m[1m[0mid[0m[0m                         = "locations/us-central1/namespaces/data-visitor-334805/services/portfolio" [33m->[0m [0m(known after apply)
        [1m[0mname[0m[0m                       = "portfolio"
      [33m~[0m [0m[1m[0mstatus[0m[0m                     = [
          [31m-[0m [0m{
              [31m-[0m [0mconditions                   = [
                  [31m-[0m [0m{
                      [31m-[0m [0mmessage = "Image 'us-central1-docker.pkg.dev/data-visitor-334805/general/portfolio:0422346' not found."
                      [31m-[0m [0mreason  = "ContainerMissing"
                      [31m-[0m [0mstatus  = "False"
                      [31m-[0m [0mtype    = "Ready"
                    },
                  [31m-[0m [0m{
                      [31m-[0m [0mmessage = "Image 'us-central1-docker.pkg.dev/data-visitor-334805/general/portfolio:0422346' not found."
                      [31m-[0m [0mreason  = "ContainerMissing"
                      [31m-[0m [0mstatus  = "False"
                      [31m-[0m [0mtype    = "ConfigurationsReady"
                    },
                  [31m-[0m [0m{
                      [31m-[0m [0mmessage = "Image 'us-central1-docker.pkg.dev/data-visitor-334805/general/portfolio:0422346' not found."
                      [31m-[0m [0mreason  = "ContainerMissing"
                      [31m-[0m [0mstatus  = "False"
                      [31m-[0m [0mtype    = "RoutesReady"
                    },
                ]
              [31m-[0m [0mlatest_created_revision_name = "portfolio-xnkxs"
              [31m-[0m [0mlatest_ready_revision_name   = ""
              [31m-[0m [0mobserved_generation          = 1
              [31m-[0m [0murl                          = ""
            },
        ] [33m->[0m [0m(known after apply)
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m [0mmetadata {
          [33m~[0m [0m[1m[0mannotations[0m[0m      = {
              [31m-[0m [0m"run.googleapis.com/ingress"        = "all"
              [31m-[0m [0m"run.googleapis.com/ingress-status" = "all"
              [31m-[0m [0m"serving.knative.dev/creator"       = "github-workflow@data-visitor-334805.iam.gserviceaccount.com"
              [31m-[0m [0m"serving.knative.dev/lastModifier"  = "github-workflow@data-visitor-334805.iam.gserviceaccount.com"
            } [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mgeneration[0m[0m       = 1 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mlabels[0m[0m           = {
              [31m-[0m [0m"cloud.googleapis.com/location" = "us-central1"
            } [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mnamespace[0m[0m        = "data-visitor-334805" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mresource_version[0m[0m = "AAXS2S6iPYU" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mself_link[0m[0m        = "/apis/serving.knative.dev/v1/namespaces/383867973730/services/portfolio" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0muid[0m[0m              = "6eefedb6-7c3c-49f7-8b53-6b67b0e63de0" [33m->[0m [0m(known after apply)
        }

      [33m~[0m [0mtemplate {
          [33m~[0m [0mmetadata {
              [33m~[0m [0m[1m[0mannotations[0m[0m      = {
                  [31m-[0m [0m"autoscaling.knative.dev/maxScale" = "100"
                } [33m->[0m [0m(known after apply)
              [33m~[0m [0m[1m[0mgeneration[0m[0m       = 0 [33m->[0m [0m(known after apply)
              [33m~[0m [0m[1m[0mlabels[0m[0m           = {} [33m->[0m [0m(known after apply)
              [32m+[0m [0m[1m[0mname[0m[0m             = (known after apply)
              [32m+[0m [0m[1m[0mnamespace[0m[0m        = (known after apply)
              [32m+[0m [0m[1m[0mresource_version[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mself_link[0m[0m        = (known after apply)
              [32m+[0m [0m[1m[0muid[0m[0m              = (known after apply)
            }

          [33m~[0m [0mspec {
              [33m~[0m [0m[1m[0mcontainer_concurrency[0m[0m = 80 [33m->[0m [0m(known after apply)
              [32m+[0m [0m[1m[0mserving_state[0m[0m         = (known after apply)
              [33m~[0m [0m[1m[0mtimeout_seconds[0m[0m       = 300 [33m->[0m [0m(known after apply)

              [33m~[0m [0mcontainers {
                  [31m-[0m [0m[1m[0margs[0m[0m    = [] [90m->[0m [0m[90mnull[0m[0m
                  [31m-[0m [0m[1m[0mcommand[0m[0m = [] [90m->[0m [0m[90mnull[0m[0m
                  [33m~[0m [0m[1m[0mimage[0m[0m   = "us-central1-docker.pkg.dev/data-visitor-334805/general/portfolio:0422346" [33m->[0m [0m"us-docker.pkg.dev/data-visitor-334805/general/portfolio:6da84d0"

                  [33m~[0m [0mports {
                      [33m~[0m [0m[1m[0mcontainer_port[0m[0m = 8080 [33m->[0m [0m(known after apply)
                      [33m~[0m [0m[1m[0mname[0m[0m           = "http1" [33m->[0m [0m(known after apply)
                      [32m+[0m [0m[1m[0mprotocol[0m[0m       = (known after apply)
                    }

                  [33m~[0m [0mresources {
                      [33m~[0m [0m[1m[0mlimits[0m[0m   = {
                          [31m-[0m [0m"cpu"    = "1000m"
                          [31m-[0m [0m"memory" = "512Mi"
                        } [33m->[0m [0m(known after apply)
                      [33m~[0m [0m[1m[0mrequests[0m[0m = {} [33m->[0m [0m(known after apply)
                    }
                }
            }
        }

      [33m~[0m [0mtraffic {
          [33m~[0m [0m[1m[0mlatest_revision[0m[0m = true [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mpercent[0m[0m         = 100 [33m->[0m [0m(known after apply)
          [32m+[0m [0m[1m[0mrevision_name[0m[0m   = (known after apply)
        }
    }

[1m  # google_cloud_run_service_iam_policy.portfolio[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_cloud_run_service_iam_policy" "portfolio" {
      [32m+[0m [0m[1m[0metag[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m    = "us-central1"
      [32m+[0m [0m[1m[0mpolicy_data[0m[0m = jsonencode(
            {
              [32m+[0m [0mbindings = [
                  [32m+[0m [0m{
                      [32m+[0m [0mmembers = [
                          [32m+[0m [0m"allUsers",
                        ]
                      [32m+[0m [0mrole    = "roles/run.invoker"
                    },
                ]
            }
        )
      [32m+[0m [0m[1m[0mproject[0m[0m     = "data-visitor-334805"
      [32m+[0m [0m[1m[0mservice[0m[0m     = "portfolio"
    }

[1m  # google_compute_backend_service.portfolio[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_backend_service" "portfolio" {
      [32m+[0m [0m[1m[0mconnection_draining_timeout_sec[0m[0m = 300
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0menable_cdn[0m[0m                      = true
      [32m+[0m [0m[1m[0mfingerprint[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mload_balancing_scheme[0m[0m           = "EXTERNAL"
      [32m+[0m [0m[1m[0mname[0m[0m                            = "portfolio"
      [32m+[0m [0m[1m[0mport_name[0m[0m                       = "http"
      [32m+[0m [0m[1m[0mproject[0m[0m                         = "data-visitor-334805"
      [32m+[0m [0m[1m[0mprotocol[0m[0m                        = "HTTP"
      [32m+[0m [0m[1m[0mself_link[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0msession_affinity[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mtimeout_sec[0m[0m                     = 30

      [32m+[0m [0mbackend {
          [32m+[0m [0m[1m[0mbalancing_mode[0m[0m               = "UTILIZATION"
          [32m+[0m [0m[1m[0mcapacity_scaler[0m[0m              = 1
          [32m+[0m [0m[1m[0mgroup[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0mmax_connections[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mmax_connections_per_endpoint[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmax_connections_per_instance[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmax_rate[0m[0m                     = (known after apply)
          [32m+[0m [0m[1m[0mmax_rate_per_endpoint[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mmax_rate_per_instance[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mmax_utilization[0m[0m              = (known after apply)
        }

      [32m+[0m [0mcdn_policy {
          [32m+[0m [0m[1m[0mcache_mode[0m[0m                   = "CACHE_ALL_STATIC"
          [32m+[0m [0m[1m[0mclient_ttl[0m[0m                   = 7200
          [32m+[0m [0m[1m[0mdefault_ttl[0m[0m                  = 3600
          [32m+[0m [0m[1m[0mmax_ttl[0m[0m                      = 10800
          [32m+[0m [0m[1m[0mnegative_caching[0m[0m             = true
          [32m+[0m [0m[1m[0mserve_while_stale[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0msigned_url_cache_max_age_sec[0m[0m = 7200
        }

      [32m+[0m [0mlog_config {
          [32m+[0m [0m[1m[0menable[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0msample_rate[0m[0m = (known after apply)
        }
    }

[1m  # google_compute_global_forwarding_rule.portfolio[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_global_forwarding_rule" "portfolio" {
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mip_address[0m[0m            = "34.117.171.161"
      [32m+[0m [0m[1m[0mip_protocol[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mload_balancing_scheme[0m[0m = "EXTERNAL"
      [32m+[0m [0m[1m[0mname[0m[0m                  = "portfolio"
      [32m+[0m [0m[1m[0mport_range[0m[0m            = "443"
      [32m+[0m [0m[1m[0mproject[0m[0m               = "data-visitor-334805"
      [32m+[0m [0m[1m[0mself_link[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mtarget[0m[0m                = (known after apply)
    }

[1m  # google_compute_region_network_endpoint_group.portfolio[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_region_network_endpoint_group" "portfolio" {
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                  = "portfolio"
      [32m+[0m [0m[1m[0mnetwork_endpoint_type[0m[0m = "SERVERLESS"
      [32m+[0m [0m[1m[0mproject[0m[0m               = "data-visitor-334805"
      [32m+[0m [0m[1m[0mregion[0m[0m                = "us-central1"
      [32m+[0m [0m[1m[0mself_link[0m[0m             = (known after apply)

      [32m+[0m [0mcloud_run {
          [32m+[0m [0m[1m[0mservice[0m[0m = "portfolio"
        }
    }

[1m  # google_compute_target_https_proxy.portfolio[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_target_https_proxy" "portfolio" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "portfolio"
      [32m+[0m [0m[1m[0mproject[0m[0m            = "data-visitor-334805"
      [32m+[0m [0m[1m[0mproxy_bind[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mproxy_id[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mquic_override[0m[0m      = "NONE"
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mssl_certificates[0m[0m   = [
          [32m+[0m [0m"projects/data-visitor-334805/global/sslCertificates/portfolio",
        ]
      [32m+[0m [0m[1m[0murl_map[0m[0m            = (known after apply)
    }

[1m  # google_compute_url_map.portfolio[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_url_map" "portfolio" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdefault_service[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mfingerprint[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mmap_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "portfolio"
      [32m+[0m [0m[1m[0mproject[0m[0m            = "data-visitor-334805"
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
    }

[0m[1mPlan:[0m 7 to add, 0 to change, 1 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @doughepi, Action: `pull_request`*